import React from 'react'


/* img su dung path public */
function Footer(){
    return(
        <footer>
          
        <div className="footer">
          <div className="footer-i">
            <h5>CHĂM SÓC KHÁCH HÀNG</h5>
            <p><a href="/soon">Trung Tâm Trợ Giúp</a></p>
            <p><a href="/soon">Shop Blog</a></p>
            <p><a href="/soon">Hướng Dẫn Mua Hàng</a></p>
            <p><a href="/soon">Hướng Dẫn bán Hàng</a></p>
            <p><a href="/soon">Thanh Toán</a></p>
            <p><a href="/soon">Trả Hàng &amp; Hoàn Tiền</a></p>
            <p><a href="/soon">Chính sách Bảo Hành</a></p>
          </div>
          <div className="footer-i">
            <h5>VỀ SHOP</h5>
            <p><a href="/soon">Giới Thiệu Về Shop</a></p>
            <p><a href="/soon">Tuyển Dụng</a></p>
            <p><a href="/soon">Diều Khoản</a></p>
            <p><a href="/soon">chính Sách Bảo Mật</a></p>
            <p><a href="/soon">Kênh Người Bán</a></p>
            <p><a href="/soon">Sales</a></p>
          </div>
          <div className="footer-i">
            <div>
              
              <h5>THANH TOÁN</h5>
              
              <div className='inline-footer'>
              <img src="../../public/images/icon/visa.svg" width="48px" alt="visa" />
             
              <img src="../../public/images/icon/mastercard.svg" width="48px" alt="mastercard" />
             </div>

            </div>
            <div>
              <h5>ĐƠN VỊ VẬN CHUYỂN</h5>
              <div  className='inline-footer'>
               
              <img src="../../public/images/images/vietnampost.png" width="48px" alt="vietnampost" />
            
              <img src="../../public/images/images/giaohangnhanh.png" width="48px" alt="giao hang nhanh" />
             
              </div>
            </div>
          </div>
          <div className="footer-i">
            <h5>THEO DÕI CHÚNG TÔI TRÊN</h5>
            {/*tip css*/}
            <p><a href="/soon">
                <svg version="1.1" id="Capa_1" xmlns="http://www.w3.org/2000/svg" xmlnsXlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 167.657 167.657" style={{enableBackground: 'new 0 0 167.657 167.657'}} xmlSpace="preserve">
                  <g>
                    <path d="M83.829,0.349C37.532,0.349,0,37.881,0,84.178c0,41.523,30.222,75.911,69.848,82.57v-65.081H49.626
		v-23.42h20.222V60.978c0-20.037,12.238-30.956,30.115-30.956c8.562,0,15.92,0.638,18.056,0.919v20.944l-12.399,0.006
		c-9.72,0-11.594,4.618-11.594,11.397v14.947h23.193l-3.025,23.42H94.026v65.653c41.476-5.048,73.631-40.312,73.631-83.154
		C167.657,37.881,130.125,0.349,83.829,0.349z" />
                  </g>
                </svg>
                <span>Facebook</span></a></p>
            <p><a href="/soon"><svg viewBox="0 0 512.00096 512.00096" xmlns="http://www.w3.org/2000/svg"><path d="m373.40625 0h-234.8125c-76.421875 0-138.59375 62.171875-138.59375 138.59375v234.816406c0 76.417969 62.171875 138.589844 138.59375 138.589844h234.816406c76.417969 0 138.589844-62.171875 138.589844-138.589844v-234.816406c0-76.421875-62.171875-138.59375-138.59375-138.59375zm-117.40625 395.996094c-77.195312 0-139.996094-62.800782-139.996094-139.996094s62.800782-139.996094 139.996094-139.996094 139.996094 62.800782 139.996094 139.996094-62.800782 139.996094-139.996094 139.996094zm143.34375-246.976563c-22.8125 0-41.367188-18.554687-41.367188-41.367187s18.554688-41.371094 41.367188-41.371094 41.371094 18.558594 41.371094 41.371094-18.558594 41.367187-41.371094 41.367187zm0 0" /><path d="m256 146.019531c-60.640625 0-109.980469 49.335938-109.980469 109.980469 0 60.640625 49.339844 109.980469 109.980469 109.980469 60.644531 0 109.980469-49.339844 109.980469-109.980469 0-60.644531-49.335938-109.980469-109.980469-109.980469zm0 0" /><path d="m399.34375 96.300781c-6.257812 0-11.351562 5.09375-11.351562 11.351563 0 6.257812 5.09375 11.351562 11.351562 11.351562 6.261719 0 11.355469-5.089844 11.355469-11.351562 0-6.261719-5.09375-11.351563-11.355469-11.351563zm0 0" /></svg><span>Instagram</span></a></p>
            <p><a href="/soon"><svg height="512pt" viewBox="0 0 512 512" width="512pt" xmlns="http://www.w3.org/2000/svg"><path d="m475.074219 0h-438.148438c-20.394531 0-36.925781 16.53125-36.925781 36.925781v438.148438c0 20.394531 16.53125 36.925781 36.925781 36.925781h438.148438c20.394531 0 36.925781-16.53125 36.925781-36.925781v-438.148438c0-20.394531-16.53125-36.925781-36.925781-36.925781zm-293.464844 387h-62.347656v-187.574219h62.347656zm-31.171875-213.1875h-.40625c-20.921875 0-34.453125-14.402344-34.453125-32.402344 0-18.40625 13.945313-32.410156 35.273437-32.410156 21.328126 0 34.453126 14.003906 34.859376 32.410156 0 18-13.53125 32.402344-35.273438 32.402344zm255.984375 213.1875h-62.339844v-100.347656c0-25.21875-9.027343-42.417969-31.585937-42.417969-17.222656 0-27.480469 11.601563-31.988282 22.800781-1.648437 4.007813-2.050781 9.609375-2.050781 15.214844v104.75h-62.34375s.816407-169.976562 0-187.574219h62.34375v26.558594c8.285157-12.78125 23.109375-30.960937 56.1875-30.960937 41.019531 0 71.777344 26.808593 71.777344 84.421874zm0 0" /></svg><span>LinkIdin</span></a></p>
          </div>
        </div>
      </footer>
    )

}


export default Footer;